In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
# Generate a random number between 1 and 15
random_num = random.sample(range(1, 16), 7)

In [3]:
df = pd.read_excel('test.xlsx',dtype='object').head(18)

In [4]:
df = df.drop(columns=['three','two','one'])

In [5]:
for col,num in enumerate(random_num):
    df.loc[num,df.columns[col]] = np.nan

In [10]:
df[pd.isnull(df['cust_name'])]

,customer_id,cust_name,bank_ac_number,bank_code,type,balance_amount,age,dob
7,229368,NaN,5038599670,1779,two,4818.16,23,2000-09-02

In [9]:
df[df['cust_name'].isna()]

,customer_id,cust_name,bank_ac_number,bank_code,type,balance_amount,age,dob
7,229368,NaN,5038599670,1779,two,4818.16,23,2000-09-02